% -*- mode: Noweb; noweb-code-mode: latex-mode -*-%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% QPA Project User Documentation
% DESCRIPTION grpalg.tex
%
% Copyright, 1998, 1999 Virginia Polytechnic Institute and State University.
% Copyright, 1998, 1999 Virginia Tech Path Algebra Project. All rights reserved.
%
% This file may be distributed in accordance with the stipulations existing
% in the LICENSE file accompanying this software.
%
% $Id: grpalg.tex,v 1.1 2010/05/07 13:16:24 sunnyquiver Exp $
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
\Chapter{Group Algebras}

A group algebras is constructed from a  group $G$ and a field $F$. 
The group algebra $FG$ is the set of linear combinations of group 
elements from $G$ with coefficients from $F$. Addition is a formal
operation in $FG$, which multiplication is defined by the multiplication 
in $G$ distributed over addition in the natural way.

GAP4 supports the elementwise operations by defining
'magma rings'. See the files 'mgmring.gd' and
'mgmring.gi' for details on magma rings. We build on top of
magma rings to provide the additional functionality and specialized
versions of some algebraic computations not provided in GAP4.

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
\Section{Constructing Group Algebras}

\>GroupAlgebra( <F>, <G> ) F

This constructions the path algebra $FG$.

\beginexample 
gap> g:= DihedralGroup(8); 
<pc group of size 8 with 3 generators>
gap> f := FiniteField(23);
GF(23)
gap> fg := GroupAlgebra(f,g);
<algebra-with-one over GF(23), with 3 generators>
\endexample

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
\Section{Categories and Properties of Group Algebras}

\>IsGroupAlgebra( <object> ) P

is true when <object> is a path algebra.

%% This is really a synonym for IsGroupRing and IsAlgebra
%% rather than a new category

\beginexample
gap> IsGroupAlgebra(fg);
true
\endexample
%%The next line actually blows up when I tried it.
%%gap> IsGroupAlgebra(f);
%%false
%%\endexample

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
\Section{Attributes and Operations for Group Algebras}

\>Centre( <groupalgebra> ) A

returns the centre of the <pathalgebra>.

\beginexample
gap> Centre(fg);
<algebra of dimension 5 over GF(23)>
\endexample


\>PowerSubalgebra( <groupalgebra>, <d> ) A

returns a power subalgebra of an
algebra $A$ defined over a finite field $F$. Let $q = p^m$, and $F =
F_q$. Then for each divisor $d$ of $m$, the subalgebra consisting of
the elements such that $a^r = a$ where $r = p^d$ is a power
subalgebra.


\beginexample
gap> PowerSubalgebra(fg,1);
<algebra of dimension 4 over GF(23)>
\endexample

\>GroupOfGroupAlgebra( <groupalgebra> ) A

returns the group used to define the group algebra.


\beginexample
gap> GroupOfGroupAlgebra(fg);
<pc group of size 8 with 3 generators>
\endexample
