%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% QPA Project User Documentation
% DESCRIPTION: opal.tex:  The documentation of the hopf implementation of 
%                         interfacing GAP and Opal.
%
% Copyright, 1998 Virginia Polytechnic Institute and State University.
% Copyright, 1998 Virginia Tech Hopf Project. All rights reserved.
%
% This file may be distributed in accordance with the stipulations existing
% in the LICENSE file accompanying this software.
%
% $Id: opal.tex,v 1.1 2010/05/07 13:16:24 sunnyquiver Exp $
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

\Chapter{Using Opal with GAP}

\Section{Setting up Opal}

\>Opal

`Opal' is a non-commutative Gr\accent127 obner Basis package which assumes that 
algebras will be represented as quotients of path algebras.  Also in 
{\QPA} the only algebras which can be used with `Opal' are ideals or 
quotients of path algebras.  

There is some work which needs to be done before you can use `Opal' 
with {\GAP}.  First you need a copy of `Opal'.  This can be obtained from 
the website \URL{http://pigweed.cs.vt.edu/opal/opal-1.0.html}.  On the site 
there are a few versions so pick the version suited for your 
computer.  The file is compressed so you need to decompress it using 
`gunzip'.  Also you need to make sure the executable file is named 
<Opal>.  Finally, make sure the Opal file has the executable 
abilities and if it does not add the execute mode to the file using 
`chmod'.

Once you have a copy of `Opal' then you need to configure {\GAP} so it can 
work with `Opal'.  Included in the `pkg/hopf' directory of the hopf package is a shell script 
called `configure' which will help setup the {\GAP} to `Opal' interface.  
First let `GAPDIR' be the directory where {\GAP} is installed and let 
`OPALDIR' be the directory where `Opal' is located.
 To set up the interface,
run the configure script
from the command line 
in the following manner.

`configure --gapdir=GAPDIR  --opaldir=OPALDIR'

This will setup the {\GAP} to `Opal' interface and allow you to use `Opal' 
with {\GAP.}

\Section{Opal Commands in Hopf}

\>`Orders In Opal'{Orders}

`Opal' does not allow all of the orders of path algebras which are allowed in
{\QPA}.   Allowable orders are, lexicographic, length, reverse, weight and 
vector orderings.  The orders which are not allowed are block and wreath 
orders.

\>OpalFiniteGroebnerBasis( <I> ) F

This command will compute a complete finite Gr\accent127 obner Basis.  But you must use 
this command with caution.  There are no breaks or bounds placed on the 
computation of the basis.  So this command should only be used if you are sure
that your basis is finite.  If you are not sure about having a finite basis
then you should use one of the following commands.

The example below shows a finite basis and how to rerieve the basis in list
form using the Enumerator command described in the Gr\accent127 obner Basis section.  

\beginexample
gap> Q:=Quiver(1,[[1,1,"a"],[1,1,"b"]]);
<quiver with 1 vertices and 2 arrows>
gap> A:=PathAlgebra(GF(7),Q);
<algebra-with-one over GF(7), with 3 generators>
gap> I:=Ideal(A,[A.a*A.b*A.b-A.b*A.b*A.a,A.b^3,A.a^3]);
<two-sided ideal in <algebra-with-one over GF(7), with 3 generators>, 
  (3 generators)>
gap> gb:=OpalFiniteGroebnerBasis(I);
<complete two-sided Groebner basis containing 5 elements>
gap> B:=Enumerator(gb);
[ (Z(7)^0)*a^3, (Z(7)^3)*a*b^2+(Z(7)^0)*b^2*a, (Z(7)^0)*b^3, (Z(7)^0)*b*a*b^2,
  (Z(7)^0)*b*a^2*b^2 ]
\endexample

\>OpalGroebnerBasis( <I> ) F

This will 
compute a complete or partial Gr\accent127 obner Basis of the ideal.  The command will
only produce up to twenty more basis elements and then stop its computation.  
If you would like to produce more basis elements, then you can redefine the
ideal using these basis elements and run the command on that ideal.  Or you
can use the following command.

The next example has an infinite basis and shows how to get more than twenty 
new basis elements.  Also it shows how to put in a different ordering to the 
quiver and thus to the algebra.

\beginexample
gap> Q:=Quiver(1,[[1,1,"x"],[1,1,"y"]]);                 
<quiver with 1 vertices and 2 arrows>
gap> order:=RightLexicographicOrdering(Q,[Q.v1,Q.x,Q.y]);
<right lexicographic ordering>
gap> order:=LengthOrdering(Q,order);                     
<length right lexicographic ordering>
gap> Q2:=OrderedBy(Q,order);                             
<quiver with 1 vertices and 2 arrows>
gap> A2:=PathAlgebra(GF(11),Q2);                         
<algebra-with-one over GF(11), with 3 generators>
gap> I2:=Ideal(A2,[A2.x*A2.y*A2.x-A2.y*A2.x]);           
<two-sided ideal in <algebra-with-one over GF(11), with 3 generators>, 
  (1 generators)>
gap> gb:=OpalGroebnerBasis(I2);
<partial two-sided Groebner basis containing 21 elements>
gap> B:=Enumerator(gb);
[ (Z(11)^5)*y*x+(Z(11)^0)*x*y*x, (Z(11)^5)*y^2*x+(Z(11)^0)*x*y^2*x, 
  (Z(11)^5)*y^3*x+(Z(11)^0)*x*y^3*x, (Z(11)^5)*y^4*x+(Z(11)^0)*x*y^4*x, 
  (Z(11)^5)*y^5*x+(Z(11)^0)*x*y^5*x, (Z(11)^5)*y^6*x+(Z(11)^0)*x*y^6*x, 
  (Z(11)^5)*y^7*x+(Z(11)^0)*x*y^7*x, (Z(11)^5)*y^8*x+(Z(11)^0)*x*y^8*x, 
  (Z(11)^5)*y^9*x+(Z(11)^0)*x*y^9*x, (Z(11)^5)*y^10*x+(Z(11)^0)*x*y^10*x, 
  (Z(11)^5)*y^11*x+(Z(11)^0)*x*y^11*x, (Z(11)^5)*y^12*x+(Z(11)^0)*x*y^12*x, 
  (Z(11)^5)*y^13*x+(Z(11)^0)*x*y^13*x, (Z(11)^5)*y^14*x+(Z(11)^0)*x*y^14*x, 
  (Z(11)^5)*y^15*x+(Z(11)^0)*x*y^15*x, (Z(11)^5)*y^16*x+(Z(11)^0)*x*y^16*x, 
  (Z(11)^5)*y^17*x+(Z(11)^0)*x*y^17*x, (Z(11)^5)*y^18*x+(Z(11)^0)*x*y^18*x, 
  (Z(11)^5)*y^19*x+(Z(11)^0)*x*y^19*x, (Z(11)^5)*y^20*x+(Z(11)^0)*x*y^20*x, 
  (Z(11)^5)*y^21*x+(Z(11)^0)*x*y^21*x ]
gap> I3:=Ideal(A2,B);
<two-sided ideal in <algebra-with-one over GF(11), with 3 generators>, 
  (21 generators)>
gap> gb:=OpalGroebnerBasis(I3);
<partial two-sided Groebner basis containing 41 elements>
gap> Enumerator(gb);
[ (Z(11)^5)*y*x+(Z(11)^0)*x*y*x, (Z(11)^5)*y^2*x+(Z(11)^0)*x*y^2*x, 
  (Z(11)^5)*y^3*x+(Z(11)^0)*x*y^3*x, (Z(11)^5)*y^4*x+(Z(11)^0)*x*y^4*x, 
  (Z(11)^5)*y^5*x+(Z(11)^0)*x*y^5*x, (Z(11)^5)*y^6*x+(Z(11)^0)*x*y^6*x, 
  (Z(11)^5)*y^7*x+(Z(11)^0)*x*y^7*x, (Z(11)^5)*y^8*x+(Z(11)^0)*x*y^8*x, 
  (Z(11)^5)*y^9*x+(Z(11)^0)*x*y^9*x, (Z(11)^5)*y^10*x+(Z(11)^0)*x*y^10*x, 
  (Z(11)^5)*y^11*x+(Z(11)^0)*x*y^11*x, (Z(11)^5)*y^12*x+(Z(11)^0)*x*y^12*x, 
  (Z(11)^5)*y^13*x+(Z(11)^0)*x*y^13*x, (Z(11)^5)*y^14*x+(Z(11)^0)*x*y^14*x, 
  (Z(11)^5)*y^15*x+(Z(11)^0)*x*y^15*x, (Z(11)^5)*y^16*x+(Z(11)^0)*x*y^16*x, 
  (Z(11)^5)*y^17*x+(Z(11)^0)*x*y^17*x, (Z(11)^5)*y^18*x+(Z(11)^0)*x*y^18*x, 
  (Z(11)^5)*y^19*x+(Z(11)^0)*x*y^19*x, (Z(11)^5)*y^20*x+(Z(11)^0)*x*y^20*x, 
  (Z(11)^5)*y^21*x+(Z(11)^0)*x*y^21*x, (Z(11)^5)*y^22*x+(Z(11)^0)*x*y^22*x, 
  (Z(11)^5)*y^23*x+(Z(11)^0)*x*y^23*x, (Z(11)^5)*y^24*x+(Z(11)^0)*x*y^24*x, 
  (Z(11)^5)*y^25*x+(Z(11)^0)*x*y^25*x, (Z(11)^5)*y^26*x+(Z(11)^0)*x*y^26*x, 
  (Z(11)^5)*y^27*x+(Z(11)^0)*x*y^27*x, (Z(11)^5)*y^28*x+(Z(11)^0)*x*y^28*x, 
  (Z(11)^5)*y^29*x+(Z(11)^0)*x*y^29*x, (Z(11)^5)*y^30*x+(Z(11)^0)*x*y^30*x, 
  (Z(11)^5)*y^31*x+(Z(11)^0)*x*y^31*x, (Z(11)^5)*y^32*x+(Z(11)^0)*x*y^32*x, 
  (Z(11)^5)*y^33*x+(Z(11)^0)*x*y^33*x, (Z(11)^5)*y^34*x+(Z(11)^0)*x*y^34*x, 
  (Z(11)^5)*y^35*x+(Z(11)^0)*x*y^35*x, (Z(11)^5)*y^36*x+(Z(11)^0)*x*y^36*x, 
  (Z(11)^5)*y^37*x+(Z(11)^0)*x*y^37*x, (Z(11)^5)*y^38*x+(Z(11)^0)*x*y^38*x, 
  (Z(11)^5)*y^39*x+(Z(11)^0)*x*y^39*x, (Z(11)^5)*y^40*x+(Z(11)^0)*x*y^40*x, 
  (Z(11)^5)*y^41*x+(Z(11)^0)*x*y^41*x ]
\endexample

\>OpalBoundedGroebnerBasis( <I> , <n> ) F

This function works like `OpalGroebnerBasis', but it allows you to set the
bound at which you would like to see computation stopped.  So if you knew your
basis was large or infinite.  Then you could choose to see the first 100 or 
maybe just the first 5 new basis elements.  The bound counts new elements added
to the basis and stops at your bound.  So if you asked it to stop at a bound
of 40 and there were 2 generators of the ideal, then you would get back a 
basis with 42 elements. 

The final example computes the same as the previous example but in one
computation.

\beginexample
gap> Q:=Quiver(1,[[1,1,"x"],[1,1,"y"]]);                 
<quiver with 1 vertices and 2 arrows>
gap> order:=RightLexicographicOrdering(Q,[Q.v1,Q.x,Q.y]);
<right lexicographic ordering>
gap> order:=LengthOrdering(Q,order);                     
<length right lexicographic ordering>
gap> Q2:=OrderedBy(Q,order);                             
<quiver with 1 vertices and 2 arrows>
gap> A:=PathAlgebra(GF(11),Q2);                         
<algebra-with-one over GF(11), with 3 generators>
gap> I:=Ideal(A,[A.x*A.y*A.x-A.y*A.x]);           
<two-sided ideal in <algebra-with-one over GF(11), with 3 generators>, 
  (1 generators)>
gap> gb:=OpalBoundedGroebnerBasis(I,40);
<partial two-sided Groebner basis containing 41 elements>
gap> B:=Enumerator(gb);
[ (Z(11)^5)*y*x+(Z(11)^0)*x*y*x, (Z(11)^5)*y^2*x+(Z(11)^0)*x*y^2*x, 
  (Z(11)^5)*y^3*x+(Z(11)^0)*x*y^3*x, (Z(11)^5)*y^4*x+(Z(11)^0)*x*y^4*x, 
  (Z(11)^5)*y^5*x+(Z(11)^0)*x*y^5*x, (Z(11)^5)*y^6*x+(Z(11)^0)*x*y^6*x, 
  (Z(11)^5)*y^7*x+(Z(11)^0)*x*y^7*x, (Z(11)^5)*y^8*x+(Z(11)^0)*x*y^8*x, 
  (Z(11)^5)*y^9*x+(Z(11)^0)*x*y^9*x, (Z(11)^5)*y^10*x+(Z(11)^0)*x*y^10*x, 
  (Z(11)^5)*y^11*x+(Z(11)^0)*x*y^11*x, (Z(11)^5)*y^12*x+(Z(11)^0)*x*y^12*x, 
  (Z(11)^5)*y^13*x+(Z(11)^0)*x*y^13*x, (Z(11)^5)*y^14*x+(Z(11)^0)*x*y^14*x, 
  (Z(11)^5)*y^15*x+(Z(11)^0)*x*y^15*x, (Z(11)^5)*y^16*x+(Z(11)^0)*x*y^16*x, 
  (Z(11)^5)*y^17*x+(Z(11)^0)*x*y^17*x, (Z(11)^5)*y^18*x+(Z(11)^0)*x*y^18*x, 
  (Z(11)^5)*y^19*x+(Z(11)^0)*x*y^19*x, (Z(11)^5)*y^20*x+(Z(11)^0)*x*y^20*x, 
  (Z(11)^5)*y^21*x+(Z(11)^0)*x*y^21*x, (Z(11)^5)*y^22*x+(Z(11)^0)*x*y^22*x, 
  (Z(11)^5)*y^23*x+(Z(11)^0)*x*y^23*x, (Z(11)^5)*y^24*x+(Z(11)^0)*x*y^24*x, 
  (Z(11)^5)*y^25*x+(Z(11)^0)*x*y^25*x, (Z(11)^5)*y^26*x+(Z(11)^0)*x*y^26*x, 
  (Z(11)^5)*y^27*x+(Z(11)^0)*x*y^27*x, (Z(11)^5)*y^28*x+(Z(11)^0)*x*y^28*x, 
  (Z(11)^5)*y^29*x+(Z(11)^0)*x*y^29*x, (Z(11)^5)*y^30*x+(Z(11)^0)*x*y^30*x, 
  (Z(11)^5)*y^31*x+(Z(11)^0)*x*y^31*x, (Z(11)^5)*y^32*x+(Z(11)^0)*x*y^32*x, 
  (Z(11)^5)*y^33*x+(Z(11)^0)*x*y^33*x, (Z(11)^5)*y^34*x+(Z(11)^0)*x*y^34*x, 
  (Z(11)^5)*y^35*x+(Z(11)^0)*x*y^35*x, (Z(11)^5)*y^36*x+(Z(11)^0)*x*y^36*x, 
  (Z(11)^5)*y^37*x+(Z(11)^0)*x*y^37*x, (Z(11)^5)*y^38*x+(Z(11)^0)*x*y^38*x, 
  (Z(11)^5)*y^39*x+(Z(11)^0)*x*y^39*x, (Z(11)^5)*y^40*x+(Z(11)^0)*x*y^40*x, 
  (Z(11)^5)*y^41*x+(Z(11)^0)*x*y^41*x ]
\endexample
